export default function question(n) {
    return [
        {
            number: 1,
            text: 'Як називається основний закон України?',
            answers: ['Конституція +', 'Біль про права', 'ПДД', 'Акт'],
            correct: 0,
            tip: 'Питання стосується людей, а не автомобілів',
            weight: 1
        },
        {
            number: 2,
            text: 'Як називають знавця багатьох мов?',
            answers: ['Поліграф', 'Полімер', 'Поліестр', 'Поліглот +'],
            correct: 3,
            tip: 'Навряд чи поліестер знає багато мов',
            weight: 1
        },
        {
            number: 3,
            text: 'Яким визначенням незмінно доповнюють старовинну назву Британських островів - "альбіон"?',
            answers: ['Похмурий', 'Дощовий', 'Туманний +', 'Вітряний'],
            correct: 2,
            tip: 'В Британії, звісно, буває дощ та вітер, але прославився він не із-за них',
            weight: 1
        },
        {
            number: 4,
            text: 'Чим Давид уразив Голіафа?',
            answers: ['Хорошими манерами', 'Красою', 'Співом', 'Каменем +'],
            correct: 3,
            tip: 'Голіафа не дуже цікавили особистісні якості Давида',
            weight: 2
        },
        {
            number: 5,
            text: 'Як раніше називався Стамбул?',
            answers: ['Софія', 'Константинополь +', 'Эль-Джазаир', 'Рангун'],
            correct: 1,
            tip: 'В правителя країни, в честь якого назвали столицю, схоже, було якесь непомірне его',
            weight: 2
        },
        {
            number: 6,
            text: 'Як раніше називався Стамбул?',
            answers: ['Софія', 'Константинополь +', 'Эль-Джазаир', 'Рангун'],
            correct: 1,
            tip: 'В правителя країни, в честь якого назвали столицю, схоже, було якесь непомірне его',
            weight: 2
        },
        {
            number: 7,
            text: 'Як раніше називався Стамбул?',
            answers: ['Софія', 'Константинополь +', 'Эль-Джазаир', 'Рангун'],
            correct: 1,
            tip: 'В правителя країни, в честь якого назвали столицю, схоже, було якесь непомірне его',
            weight: 2
        }
    ].slice(0, n)
} 