export default function question(n) {
    return [
        {
            number: 1,
            text: 'Як називається основний закон України?',
            answers: ['Конституція +', 'Біль про права', 'ПДД', 'Акт'],
            correct: 0,
            tip: 'Питання стосується людей, а не автомобілів',
            weight: 1
        },
        {
            number: 2,
            text: 'Як називають знавця багатьох мов?',
            answers: ['Поліграф', 'Полімер', 'Поліестр', 'Поліглот +'],
            correct: 3,
            tip: 'Навряд чи поліестер знає багато мов',
            weight: 1
        },
        {
            number: 3,
            text: 'Яким визначенням незмінно доповнюють старовинну назву Британських островів - "альбіон"?',
            answers: ['Похмурий', 'Дощовий', 'Туманний +', 'Вітряний'],
            correct: 2,
            tip: 'В Британії, звісно, буває дощ та вітер, але прославився він не із-за них',
            weight: 1
        },
        {
            number: 4,
            text: 'Чим Давид уразив Голіафа?',
            answers: ['Хорошими манерами', 'Красою', 'Співом', 'Каменем +'],
            correct: 3,
            tip: 'Голіафа не дуже цікавили особистісні якості Давида',
            weight: 2
        },
        {
            number: 5,
            text: 'Як раніше називався Стамбул?',
            answers: ['Софія', 'Константинополь +', 'Эль-Джазаир', 'Рангун'],
            correct: 1,
            tip: 'Раніше Стамбул був столицею Візантійської імперії',
            weight: 2
        },
        {
            number: 6,
            text: 'Ізмір це — ...',
            answers: ['Місто в Туреччині +', 'Сорт лікеру', 'Фрукт', 'Єгипетський вигук'],
            correct: 0,
            tip: 'Це не можна з\'їсти чи випити',
            weight: 2
        },
        {
            number: 7,
            text: 'До серії книг "Відьмак" Анджея Сапковського не належить...',
            answers: ['Дикий гін +', 'Час погорди', 'Вежа Ластівки', 'Сезон гроз'],
            correct: 0,
            tip: 'Один з цих варіантів - популярна комп\'ютерна гра',
            weight: 2
        }
    ].slice(0, n);
} 